---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.Dispose
source: html/6fcd61e7-a866-3127-ca93-1d9fa96fdce6.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.Dispose Method

Releases all resources used by the ExternalServiceOptions

## Syntax (C#)
```csharp
public void Dispose()
```